#include <stdio.h> //표준입출력 헤더파일 포함
#pragma warning(disable:4996) // scanf() 경고무시
#define SNUM "202435-160164" //매크로 정의 : 학번
#define SDEP "데이터통계학과" //매크로 정의 : 학과
#define SNM "구지혜" //매크로 정의 : 이름

int main(void){

    int Koo_Jihye; //입력받은 변수를 저장하기 위한 영문이름변수 생성
    
    printf("5부터 10 사이의 짝수 숫자를 입력하시오 \n(0을 입력시 프로그램 종료)\n\n"); //최초실행시 안내문

    while(Koo_Jihye != 0){ //0입력시 프로그램 종료(반복문 종료)를 위해 while문 실행  

        printf("숫자입력 : "); //숫자입력 안내 출력
        scanf("%d",&Koo_Jihye); // 사용자 입력 > 영문이름 변수에 저장

        if (Koo_Jihye % 2 == 0 && Koo_Jihye >=5 && Koo_Jihye <=10) // 5부터 10사이의 짝수 입력시
        {
            printf("----------------------------------- \n");
            printf("입력한 숫자 %d 은 5부터 10사이의 짝수 입니다. \n",Koo_Jihye);
            printf("----------------------------------- \n");
        }
        else if(Koo_Jihye % 2 == 0 && Koo_Jihye != 0 && (Koo_Jihye <=5 || Koo_Jihye >= 10)) // 짝수입력이지만 5부터 10사이의 숫자가 아닐때
        {
            printf("----------------------------------- \n");
            printf("☆ 5부터 10사이의 짝수를 입력하시오. 학과: %s \n",SDEP);
            printf("----------------------------------- \n");
        }
        else if(Koo_Jihye % 2 != 0 ) // 짝수가 아닐경우
        {
            printf("----------------------------------- \n");
            printf("★ 짝수를 입력하시오. 학번: %s \n",SNUM);
            printf("----------------------------------- \n");
        }
    }
    printf("----------------------------------- \n");
    printf("♥ 프로그램을 종료합니다. 이름: %s \n",SNM); // while조건문에 만족하지 않는 경우(0입력)
    printf("----------------------------------- \n");    

}